# SQL final

[![Open In Colab](https://colab.research.google.com/assets/colab-badge.svg)](https://colab.research.google.com/github/alikn/intro_to_business_analytics/blob/main/assignments/sql_final.ipynb)

## How to submit your assignment 
Once you are done with all questions, use `File > Download > Download .py` menu to download a Python file which includes your queries. This is the file you should submit for your assignment.

## How are the assignments graded
The assignments will be graded by computer and therefore there is no partial score for each question. Pay extra attention to the discription of the questions.

## Setup
Similar to the in-class activities, run the following cells to get started.

In [ ]:
%load_ext sql
%pip install mysqlclient

In [ ]:
host = 'bsa315.cbd3lbq00qqd.us-east-2.rds.amazonaws.com:3306/BSA315' # @param {type:"string"}
user_name = '' # @param {type:"string"}
password = '' # @param {type:"string"}
db_address = f'mysql://{user_name}:{password}@bsa315.cbd3lbq00qqd.us-east-2.rds.amazonaws.com:3306/BSA315'
%sql {db_address}

## Data
For the first section of this assignment, we are going to use `billboard_top_100_year_end` table.  

Query examples:

In [ ]:
query0_1 = """
SELECT *
FROM abt_datasets.billboard_top_100_year_end
LIMIT 10
"""
%sql {query0_1}

### Question 1
Output the first 10 rows of the data ordered by id ascendingly. Keep the original column names.

In [ ]:
query1 = """
Add your query here
"""
%sql {query1}

### Question 2
How many years of data does the dataset include? The output should include only one row and one column. Name the column `num_years`.
Hint: if the first year included in the dataset is for example 1901 and last year is 2000, the total number of years in the dataset is 100.

In [ ]:
query2 = """
Add your query here
"""
%sql {query2}

### Question 3
What was the name of the number 1 song in the year 2001? The output should include one row and just the `song_name` columns.

In [ ]:
query3 = """
Add your query here
"""
%sql {query3}

### Question 4
Which group appeared the most on the billboard in the current dataset? The result should include one row with two columns: `group_name` and `times` which is the number of times the group was on the billboard?

In [ ]:
query4 = """
Add your query here
"""
%sql {query4}

### Question 5
Create a new column named `top_10` which denotes if the song was ranked in top 10 (including 10) or not. If the song was in top 10 the column should have a value of 1 and otherwise a 0. Output the top 100 rows ordered by `group_name` ascendingly and include all original columns plus the new one.

In [ ]:
query5 = """
Add your query here
"""
%sql {query5}

### Question 6
Which group had the most number of top songs in a single year? The output should include one row and three columns: `group_name`, `year`, and a new column named `times` which has the number of top songs in the year.

In [ ]:
query6 = """
Add your query here
"""
%sql {query6}

### Question 7
Out of all the [one-hit-wonders](https://en.wikipedia.org/wiki/One-hit_wonder) (groups which had only one song in the dataset), which one had the best song (meaning a lower `year_rank`). If there is a tie, output the latest song. The output should include only 1 row with all the original columns.

In [ ]:
query7 = """
Add your query here
"""
%sql {query7}

Solve the following questions using these two tables:
- `airbnb_apartments`
- `airbnb_hosts`

Query examples:

In [ ]:
query0_2 = """
SELECT *
FROM abt_datasets.airbnb_apartments
LIMIT 10
"""
%sql {query0_2}

In [ ]:
query0_3 = """
SELECT *
FROM abt_datasets.airbnb_hosts
LIMIT 10
"""
%sql {query0_3}

### Question 8
Out put the aparments sorted by their owners' age in an ascending fashion. Do not change the column names.

In [ ]:
query8 = """
Add your query here
"""
%sql {query8}

### Question 9
What is the nationality of the host who owns the apartment with the highest number of bedrooms? The output should include only one row and one column: `nationality`.

In [ ]:
query9 = """
Add your query here
"""
%sql {query9}

### Question 10
Select all columns of airbnb_apartments table with one more column named `country_nationality`. The value in the new column should be 'same' if the nationality of the host is the same as the country of the apartment. Otherwise it should be 'different'. Order the output by the `apartment_id` column in an ascending fashion.

In [ ]:
query10 = """
Add your query here
"""
%sql {query10}